#+begin_src bash :results output 
  curl -s \
  -X POST 'http://127.0.0.1:7575/indexes/movies/search' \
  -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
  -H "Content-Type: application/json" \
  --data-binary '{ "q": "fox" }' \
  | \
  jq -r '.hits[0] | .overview'
#+end_src

#+RESULTS:
: Fox, a former circus performer, wins the lottery of DM 500,000 and can now have the life and things that he has always wanted. While he wants to climb up the social ladder, it isn't without turmoil, and being torn between his old working class roots, and the shiny new facade of middle class consciousness.


This is the command to slurp in and use the json data...
#+begin_src bash :results output
  jq -Rs --rawfile contents input.txt '[{id: "file_name.txt", contents: $contents}]' > input.json
#+end_src

#+RESULTS:


This is the one to try to add a document (the index
will be created automatically)

#+begin_src bash :results output 
    curl -s \
        -X POST 'http://localhost:7575/indexes/set-4/documents' \
     -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
     -H 'Content-Type: application/json' \
     --data-binary "@input.json"

    # --data-binary "[ \
     #             { \"id\": \"here\", \"contents\": \"werwklerj\" }
     #   ]" | jq -r
  #    $(jq -Rs --rawfile contents input.txt '{id: \"file_name.txt\", contents: $contents}') \

#+end_src

#+RESULTS:
: {"uid":13,"indexUid":"set-4","status":"enqueued","type":"documentAddition","enqueuedAt":"2022-05-24T05:16:46.74727Z"}



#+begin_src bash :results output
  curl -s \
     -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
  -X GET 'http://localhost:7575/tasks/14' \
     | jq -r
#+end_src

#+RESULTS:
#+begin_example
{
  "uid": 14,
  "indexUid": "set-4",
  "status": "succeeded",
  "type": "documentAddition",
  "details": {
    "receivedDocuments": 1,
    "indexedDocuments": 1
  },
  "duration": "PT0.025191S",
  "enqueuedAt": "2022-05-24T05:21:25.688136Z",
  "startedAt": "2022-05-24T05:21:25.692037Z",
  "finishedAt": "2022-05-24T05:21:25.717228Z"
}
#+end_example




Working to assemble the full command for pushing a file

#+begin_src bash :results output
  curl -s \
      -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
  -X DELETE 'http://localhost:7575/indexes/set-4/documents' \
      && \ 
  jq -Rs --rawfile contents input2.txt '[{id: "file_name4", contents: $contents}]' > input2.json \
     && \
     curl -s \
         -X POST 'http://localhost:7575/indexes/set-4/documents' \
      -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
      -H 'Content-Type: application/json' \
      --data-binary "@input2.json"
#+end_src

#+RESULTS:
: {"uid":20,"indexUid":"set-4","status":"enqueued","type":"clearAll","enqueuedAt":"2022-05-24T05:25:58.170938Z"}{"uid":21,"indexUid":"set-4","status":"enqueued","type":"documentAddition","enqueuedAt":"2022-05-24T05:25:58.228977Z"}



This is the test to get setup to use a template

The `-n` is necessary. It sends null data to jq so the rest of teh
stuff can be added. 


#+begin_src bash :results output
      cd "/Users/alan/workshop/grimoire-mode/samples"
       # jq -Rs --rawfile contents file2.txt template.jq > "/Users/alan/workshop/grimoire-mode/samples/tmp2.json"
       # jq -n --arg t1 junk -f template.jq
       jq -Rsn --rawfile t1 "set-3/file2.txt" --arg t1 junk -f template.jq
       # > "/Users/alan/workshop/grimoire-mode/samples/tmp2.json"
       # echo $(ksuid)
    #/Users/alan/workshop/grimoire-mode/samples
#+end_src

#+RESULTS:
: [
:   {
:     "id": "asdfasdf",
:     "content": "---\nblurb: \"\"\ncategories:\n- Miscellaneous\ndate: '2022-05-24T01:29:16'\nid: 29b7uo1rkxua\nstatus: scratch\ntype: post\n---\n\n\nThis is the second file\n\n;asdf \n\"\n(\n'\n\n\n"
:   }
: ]


#+begin_src bash :results output
  cd "/Users/alan/workshop/grimoire-mode/samples/set-3"
  echo $(ksuid)
  for FILE in * 
  do
      ID_HASH=$(echo -n $FILE | md5)
   echo $FILE
   echo $ID_HASH
   jq -Rsn --rawfile content $FILE --arg id $ID_HASH -f "/Users/alan/workshop/grimoire-mode/samples/template.jq" > "/Users/alan/workshop/grimoire-mode/samples/tmp.json"
   # jq -Rs --rawfile contents file2.txt '[{id: "asdf", contents: $contents}]' > "/Users/alan/workshop/grimoire-mode/samples/tmp.json"
   # jq -Rs --rawfile contents file2.txt "[{id: \"asdf\", contents: $contents}]" > "/Users/alan/workshop/grimoire-mode/samples/tmp.json"

     curl -s \
         -X POST 'http://localhost:7575/indexes/set-5/documents' \
      -H "Authorization: Bearer $(security find-generic-password -w -a alan -s alan--meilisearch--scratchpad--root-key)" \
      -H 'Content-Type: application/json' \
      --data-binary "@/Users/alan/workshop/grimoire-mode/samples/tmp.json"

   done
#+end_src

#+RESULTS:
: 29bEbZYou67qOjB5IfdyiyCk6L5
: file2.txt
: 273604bfeef7126abe1f9bff1e45126c
: {"uid":22,"indexUid":"set-5","status":"enqueued","type":"documentAddition","enqueuedAt":"2022-05-24T06:24:16.995317Z"}file3.txt
: 113f6696d140c167070bcc5e24791f35
: {"uid":23,"indexUid":"set-5","status":"enqueued","type":"documentAddition","enqueuedAt":"2022-05-24T06:24:17.047874Z"}file_name_1.txt
: 201e562db8b9269fed3939c2fdb6fd25
: {"uid":24,"indexUid":"set-5","status":"enqueued","type":"documentAddition","enqueuedAt":"2022-05-24T06:24:17.100587Z"}


